wwx365988/stm32f1_tmc5130/User/TMC_EvalSystem/hal/IOMap.c
	.MIXED4 =  // !!! DUMMY -> NOT IN HADWARE !!!
	{
		.setBitRegister      = &(GPIOA->BSRR),  // __IO uint16 *setBitRegister
		.resetBitRegister    = &(GPIOA->BRR),  // __IO uint16 *resetBitRegister
		.port                = GPIOB,            // GPIO_TypeDef *port
		.bitWeight           = DUMMY_BITWEIGHT,  // invalid
		.bit                 = -1,               // invalid
		.resetConfiguration  =
		{
			.GPIO_Mode   = GPIO_Mode_IPU,         // GPIOMode_TypeDef GPIO_Mode
//			.GPIO_OType  = GPIO_OType_PP,        // GPIOSpeed_TypeDef GPIO_Speed
			.GPIO_Speed  = GPIO_Speed_50MHz,     // GPIOOType_TypeDef GPIO_OType
//			.GPIO_PuPd   = GPIO_PuPd_NOPULL      // GPIOPuPd_TypeDef GPIO_PuPd
		}
	},

	.MIXED5 =  // !!! DUMMY -> NOT IN HADWARE !!!
	{
		.setBitRegister      = &(GPIOA->BSRR),  // __IO uint16 *setBitRegister
		.resetBitRegister    = &(GPIOA->BRR),  // __IO uint16 *resetBitRegister
		.port                = GPIOB,            // GPIO_TypeDef *port
		.bitWeight           = DUMMY_BITWEIGHT,  // invalid
		.bit                 = -1,               // invalid
		.resetConfiguration  =
		{
			.GPIO_Mode   = GPIO_Mode_IPU,         // GPIOMode_TypeDef GPIO_Mode
//			.GPIO_OType  = GPIO_OType_PP,        // GPIOSpeed_TypeDef GPIO_Speed
			.GPIO_Speed  = GPIO_Speed_50MHz,     // GPIOOType_TypeDef GPIO_OType
//			.GPIO_PuPd   = GPIO_PuPd_NOPULL      // GPIOPuPd_TypeDef GPIO_PuPd
		}
	},

	.MIXED6 =  // !!! DUMMY -> NOT IN HADWARE !!!
	{
		.setBitRegister      = &(GPIOA->BSRR),  // __IO uint16 *setBitRegister
		.resetBitRegister    = &(GPIOA->BRR),  // __IO uint16 *resetBitRegister
		.port                = GPIOB,            // GPIO_TypeDef *port
		.bitWeight           = DUMMY_BITWEIGHT,  // invalid
		.bit                 = -1,               // invalid
		.resetConfiguration  =
		{
			.GPIO_Mode   = GPIO_Mode_IPU,         // GPIOMode_TypeDef GPIO_Mode
//			.GPIO_OType  = GPIO_OType_PP,        // GPIOSpeed_TypeDef GPIO_Speed
			.GPIO_Speed  = GPIO_Speed_50MHz,     // GPIOOType_TypeDef GPIO_OType
//			.GPIO_PuPd   = GPIO_PuPd_NOPULL      // GPIOPuPd_TypeDef GPIO_PuPd
		}
	},

	.DUMMY =  // IOPinTypeDef
	{
		.setBitRegister      = &(GPIOA->BSRR),  // __IO uint16 *setBitRegister
		.resetBitRegister    = &(GPIOA->BRR),  // __IO uint16 *resetBitRegister
		.port                = GPIOB,            // GPIO_TypeDef *port
		.bitWeight           = DUMMY_BITWEIGHT,  // invalid
		.bit                 = -1,               // invalid
		.resetConfiguration  =
		{
			.GPIO_Mode   = GPIO_Mode_IPU,         // GPIOMode_TypeDef GPIO_Mode
//			.GPIO_OType  = GPIO_OType_PP,        // GPIOSpeed_TypeDef GPIO_Speed
			.GPIO_Speed  = GPIO_Speed_50MHz,     // GPIOOType_TypeDef GPIO_OType
//			.GPIO_PuPd   = GPIO_PuPd_NOPULL      // GPIOPuPd_TypeDef GPIO_PuPd
		}
	}
	#endif
};

static void init()
{
    //默认配置为高电平
//	HAL.IOs->config->reset(&HAL.IOs->pins->ID_CLK);
//	HAL.IOs->config->reset(&HAL.IOs->pins->ID_CH0);
//	HAL.IOs->config->reset(&HAL.IOs->pins->ID_CH1);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO0);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO1);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO2);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO3);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO4);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO5);
//	HAL.IOs->config->reset(&HAL.IOs->pins->AIN0);
//	HAL.IOs->config->reset(&HAL.IOs->pins->AIN1);
//	HAL.IOs->config->reset(&HAL.IOs->pins->AIN2);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO6);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO7);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO8);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO9);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO10);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO11);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_CSN0);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_CSN1);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_CSN2);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_SCK);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_SDO);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI2_SDI);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI1_CSN);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI1_SCK);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI1_SDI);
//	HAL.IOs->config->reset(&HAL.IOs->pins->SPI1_SDO);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO12);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO13);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO14);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO15);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO16);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO17);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO18);
//	HAL.IOs->config->reset(&HAL.IOs->pins->DIO19);
//	HAL.IOs->config->reset(&HAL.IOs->pins->WIRELESS_TX);
//	HAL.IOs->config->reset(&HAL.IOs->pins->WIRELESS_RX);
//	HAL.IOs->config->reset(&HAL.IOs->pins->WIRELESS_NRST);
//	HAL.IOs->config->reset(&HAL.IOs->pins->RS232_TX);
//	HAL.IOs->config->reset(&HAL.IOs->pins->RS232_RX);
//	HAL.IOs->config->reset(&HAL.IOs->pins->USB_V_BUS);
//	HAL.IOs->config->reset(&HAL.IOs->pins->USB_V_DM);
//	HAL.IOs->config->reset(&HAL.IOs->pins->USB_V_DP);
//	HAL.IOs->config->reset(&HAL.IOs->pins->VM_MEAS);
		HAL.IOs->config->reset(&HAL.IOs->pins->LED_STAT);
    HAL.IOs->config->reset(&HAL.IOs->pins->KEY_STAT);
//	HAL.IOs->config->reset(&HAL.IOs->pins->LED_ERROR);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_2);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_3);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_4);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_5);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_6);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EXTIO_7);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EEPROM_SCK);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EEPROM_SI);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EEPROM_SO);
//	HAL.IOs->config->reset(&HAL.IOs->pins->EEPROM_NCS);
//	HAL.IOs->config->reset(&HAL.IOs->pins->CLK16);
}
